Repository: deepin-community/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/img.*.po
Languages: de

source: The `img` directive is supplied by the [[!iki plugins/img desc=img]] plugin.
de: Die `img`-Anweisung wird durch die [[!iki plugins/img desc=img]]-Erweiterung bereitgestellt.

source: This is an image handling directive. While ikiwiki supports inlining full-size images by making a [[ikiwiki/WikiLink]] that points to the image, using this directive you can easily scale down an image for inclusion onto a page, providing a link to a full-size version.
de: Diese Anweisung verarbeitet Bilder. Während ikiwiki das Einbinden von Bildern in voller Größe durch einen [[ikiwiki/WikiLink]] auf das Bild unterstützt, kann man mit dieser Anweisung ein Bild einfach herunterskalieren, um es in eine Seite einzubinden, und einen Link auf das Bild in Originalgröße setzen.

source: usage
de: Verwendung

source: \[[!img image1.jpg size="200x200" alt="clouds"]]
de: \[[!img image1.jpeg size="200x200" alt="Wolken"]]

source: The image file will be searched for using the same rules as used to find the file pointed to by a [[ikiwiki/WikiLink]].
de: Diese Bilddatei wird nach den gleichen Regeln gesucht wie das Ziel eines [[ikiwiki/WikiLink]].

source: The `size` parameter is optional, defaulting to full size. You can specify only the width or the height, and the other value will be calculated based on it: "200x", "x200".
de: Der Parameter `size` ist optional, voreingestellt ist die volle Größe. Man kann auch nur die Breite oder nur die Höhe angeben, dann wird der jeweils andere Wert automatisch berechnet: `200x`, `x200`.

source: If you specify both the width and height, the original image's aspect ratio will be preserved, even if this means making the image smaller than the specified size. (However, this is not done for svg images.)
de: Wenn sowohl Breite als auch Höhe angegeben werden, wird das Seitenverhältnis des Originalbildes bewahrt, auch wenn dadurch ein kleineres Bild als angegeben entsteht. (Dies gilt jedoch nicht für SVG-Bilder.)

source: You can also pass `alt`, `title`, `class`, `align`, `id`, `hspace`, and `vspace` parameters. These are passed through unchanged to the html img tag. If you include a `caption` parameter, the caption will be displayed centered beneath the image.
de: Man kann auch die Parameter `alt`, `title`, `class`, `align`, `id`, `hspace` und `vspace` übergeben. Diese werden an den img-Tag im erzeugten HTML-Code weitergereicht. Wird der Parameter `caption` angegeben, wird sein Wert unter dem Bild zentriert angezeigt.

source: The `link` parameter is used to control whether the scaled image links to the full size version. By default it does; set "link=somepage" to link to another page instead, or "link=no" to disable the link, or "link=http://url" to link to a given url.
de: Der Parameter `link` steuert, ob herunterskalierte Bilder mit dem Originalbild verlinkt werden. In der Voreinstellung ist dies der Fall; mit `link=AndereSeite` zeigt der Link auf eine andere Seite, mit `link=no` wird der Link deaktiviert, mit `link=http://url` zeigt er auf die angegebene URL.

source: The `pagenumber` parameter selects which of multiple images should be rendered; this is relevant mainly for GIF and PDF source images.
de: Der Parameter `pagenumber` wählt aus, welches von mehreren Bildern angezeigt werden soll. Dies ist vor allem bei GIF- und PDF-Bildern relevant.

source: You can also set default values that will be applied to all later images on the page, unless overridden. Useful when including many images on a page.
de: Man kann auch die Voreinstellung für die weiter unten auf der Seite eingebundenen Bilder verändern. Dies ist nützlich, wenn es auf einer Seite viele Bilder gibt.

source: \[[!img defaults size=200x200 alt="wedding photo"]] \[[!img photo1.jpg]] \[[!img photo2.jpg]] \[[!img photo3.jpg size=200x600]]
de: \[[!img defaults size=200x200 alt="Hochzeitsfoto"]] \[[!img photo1.jpg]] \[[!img photo2.jpg]] \[[!img photo3.jpg size=200x600]]

source: format support
de: Unterstützte Formate

source: By default, the `img` directive only supports a few common web formats:
de: Standardmäßig unterstützt die `img`-Anweisung nur ein paar verbreitete Web-Formate:

source: JPEG (`.jpg` or `.jpeg`)
de: JPEG (`.jpg` oder `.jpeg`)

source: These additional formats can be enabled with the `img_allowed_formats` [[!iki setup]] option, but are disabled by default for better [[!iki security]]:
de: Die folgenden Formate können mit der `img_allowed_formats` [[!iki setup desc="Setup-Option"]] aktiviert werden, sind aber aus [[!iki security desc="Sicherheitsgründen"]] standardmäßig deaktiviert:

source: `everything` (accepts any file supported by ImageMagick: make sure that only completely trusted users can [[upload attachments|ikiwiki/pagespec/attachment]])
de: `everything` (akzeptiert alle Dateitypen, die von ImageMagick unterstützt werden: hierbei sollte sichergestellt werden, dass nur vollständig vertrauenswürdige Nutzer [[Anhänge hochladen|ikiwiki/pagespec/attachment]] können)

source: For example, a wiki where only `admin()` users can upload attachments might use:
de: Das folgende Beispiel könnte in einem Wiki verwendet werden, in dem nur `admin()`-Benutzer Anhänge hochladen dürfen:
