Repository: deepin-community/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/meta.*.po
Languages: de

source: The `meta` directive is supplied by the [[!iki plugins/meta desc=meta]] plugin.
de: Die `meta`-Anweisung wird durch die [[!iki plugins/meta desc=meta]]-Erweiterung bereitgestellt.

source: This directive allows inserting arbitrary metadata into the source of a page. Enter the metadata as follows:
de: Diese Anweisung erlaubt es, beliebige Metadaten in den Quelltext einer Seite einzufügen. Dies geschieht wie folgt:

source: The first form sets a given field to a given value, while the second form also specifies some additional sub-parameters. You can have only one field per `meta` directive, use more directives if you want to specify more fields.
de: In der ersten Form wird das angegebene Feld auf den angegebenen Wert gesetzt. In der zweiten Form werden zusätzlich einige Unter-Parameter angegeben. Pro `meta`-Anweisung kann nur ein Feld gesetzt werden; um mehrere Felder anzugeben bitte die `meta`-Anweisung wiederholt verwenden.

source: The field values are treated as HTML entity-escaped text, so you can include a quote in the text by writing `&quot;` and so on.
de: Die Feldwerte können HTML-Entities enthalten, zum Beispiel kann durch `&quot;` ein Anführungszeichen eingefügt werden.

source: Supported fields
de: Unterstützte Felder

source: Overrides the title of the page, which is generally the same as the page name.
de: Überschreibt den Titel der Seite, der normalerweise dem Namen der Seite entspricht.

source: Note that if the title is overridden, a "title_overridden" variable will be set to a true value in the template; this can be used to format things differently in this case.
de: Wenn der Titel so überschrieben wird, wird die Template-Variable `title_overridden` auf wahr gesetzt. Eine Vorlage kann in diesem Fall eine andere Darstellung wählen.

source: An optional `sortas` parameter will be used preferentially when [[ikiwiki/pagespec/sorting]] by `meta(title)`:
de: Mit dem optionalen Parameter `sortas` kann die Sortierreihenfolge verändert werden, wenn nach `meta(title)` [[sortiert|ikiwiki/pagespec/sorting]] wird:

source: Specifies a license for the page, for example, "GPL". Can contain WikiLinks and arbitrary markup.
de: Gibt eine Lizenz für die Seite an, etwa `GPL`. Kann WikiLinks und beliebige Formatierungsanweisungen enhalten.

source: Specifies the copyright of the page, for example, "Copyright 2007 by Joey Hess". Can contain WikiLinks and arbitrary markup.
de: Gibt die Urheberrechte der Seite an, zum Beispiel `Copyright 2007 by Joey Hess`. Kann WikiLinks und beliebige Formatierungsanweisungen enhalten.

source: Specifies the author of a page.
de: Gibt den Autor der Seite an.

source: An optional `sortas` parameter will be used preferentially when [[ikiwiki/pagespec/sorting]] by `meta(author)`:
de: Mit dem optionalen Parameter `sortas` kann die Sortierreihenfolge verändert werden, wenn nach `meta(author)` [[sortiert|ikiwiki/pagespec/sorting]] wird:

source: Specifies an url for the author of a page.
de: Gibt eine URL für den Autor der Seite an.

source: Specifies a short description for the page. This will be put in the html header, and can also be displayed by eg, the [[map]] directive.
de: Gibt eine kurze Beschreibung der Seite an. Diese wird im HTML-Header angegeben und kann zum Beispiel auch durch die [[map]]-Anweisung ausgegeben werden.

source: keywords
de: Schlüsselwörter

source: Specifies keywords summarizing the contents of the page. This information will be put in the html header. Only letters, numbers, spaces and commas are allowed in this string; other characters are stripped. Note that the majority of search engines, including Google, do not use information from the keywords header.
de: Gibt die Schlüsselwörter an, die den Inhalt der Seite zusammenfassen. Diese Information wird im HTML-Header ausgegeben. Nur Buchstaben, Ziffern, Leerzeichen und Kommas sind zulässig, andere Zeichen werden entfernt. Die meisten Suchmaschinen (u.a. Google) ignorieren Informationen im keywords-Header.

source: Specifies a permanent link to the page, if different than the page generated by ikiwiki.
de: Gibt einen dauerhaften Link zu der Seite an, wenn dieser anders ist als die von ikiwiki generierte Seite.

source: Specifies the creation date of the page. This creates a `<meta name="date" content="...">` header in the HTML output, but also modifies the internal `ctime` in the [[!iki tips/inside_dot_ikiwiki desc="internal index"]]. The date can be entered in nearly any format, since it's parsed by [[!cpan TimeDate]] but invalid dates yield an error in 3.20180321 or later.
de: Gibt das Erstellungsdatum der Seite an. Die erzeugt einen `<meta name="date" content="...">`-Header in der HTML-Ausgabe und setzt die interne `ctime` für den [[!iki tips/inside_dot_ikiwiki desc="internen Index"]]. Das Datum kann in nahezu jedem Format angegeben werden, da es durch [[!cpan TimeDate]] ausgewertet wird. Allerdings führen ungültige Werte seit Version 3.20180321 zu Fehlern.

source: Adds a stylesheet to a page. The stylesheet is treated as a wiki link to a `.css` file in the wiki, so it cannot be used to add links to external stylesheets. Example:
de: Fügt ein Stylesheet zu der Seite hinzu. Der angegebene Name wird als WikiLink zu einer `.css`-Datei im Wiki behandelt, es können also keine externen Stylesheets eingebunden werden. Beispiel:

source: However, this will be scrubbed away if the [[!iki plugins/htmlscrubber desc=htmlscrubber]] plugin is enabled, since it can be used to insert unsafe content.
de: Allerdings wird diese zweite Syntax entfernt, wenn die [[!iki plugins/htmlscrubber desc=htmlscrubber]]-Erweiterung aktiviert ist, weil auf diese Weise unsichere Inhalte eingefügt werden können.

source: Adds a script to a page. The script is treated as a wiki link to a `.js` file in the wiki, so it cannot be used to add links to external scripts. The optional `defer` and `async` keywords can be used to set the corresponding HTML4 and HTML5 script options. Example:
de: Fügt ein Skript zu der Seite hinzu. Der angegebene Name wird als WikiLink zu einer `.js`-Datei im Wiki behandelt, es können also keine externen Skripte eingebunden werden. Die optionalen Schlüsselwörter `defer` und `async` setzen die entsprechenden HTML4- und HTML5-Optionen. Beispiel:

source: \[[!meta script=somescript defer async]]
de: \[[!meta script=einskript defer async]]

source: The tag is subject to scrubbing as with the stylesheet and link fields.
de: Der Tag unterliegt den gleichen [[!iki plugins/htmlscrubber desc=htmlscrubber]]-Einschränkungen wie die Felder stylesheet und link.

source: Adds html &lt;link&gt; tags to perform OpenID delegation to an external OpenID server. This lets you use an ikiwiki page as your OpenID.
de: Fügt die nötigen &lt;link&gt;-Tags für die Weiterleitung an einen externen OpenID-Server ein. Dadurch kann eine ikiwiki-Seite als OpenID verwendet werden.

source: By default this will delegate for both `openid` and `openid2`. To only delegate for one, add a parameter such as `delegate=openid`.
de: Standardmäßig werden sowohl `openid` als auch `openid2` weitergeleitet. Um nur eines davon weiterzuleiten, kann ein Parameter wie `delegate=openid` verwendet werden.

source: An optional `xrds-location` parameter lets you specify the location of any [eXtensible Resource DescriptorS](http://www.windley.com/archives/2007/05/using_xrds.shtml).
de: Der optionale Parameter `xrds-location` erlaubt es, den Ort eines [eXtensible Resource DescriptorS](http://www.windley.com/archives/2007/05/using_xrds.shtml) anzugeben.

source: Example:
de: Beispiel:

source: Specifies a link to another page. This can be used as a way to make the wiki treat one page as linking to another without displaying a user-visible [[ikiwiki/WikiLink]]:
de: Gibt einen Link zu einer anderen Seite an. Auf diese Weise kann das Wiki dazu gebracht werden, eine Seite so zu behandeln, als ob sie einen Link auf eine andere enthält, ohne dass die Benutzer einen [[ikiwiki/WikiLink]] zu Gesicht bekommen:

source: \[[!meta link=otherpage]]
de: \[[!meta link=andereseite]]

source: It can also be used to insert a html &lt;link&gt; tag. For example:
de: Es kann auch ein HTML &lt;link&gt;-Tag eingefügt werden, zum Beispiel:

source: However, this latter syntax won't be allowed if the [[!iki plugins/htmlscrubber desc=htmlscrubber]] plugin is enabled, since it can be used to insert unsafe content.
de: Allerdings ist diese zweite Syntax nicht erlaubt, wenn die [[!iki plugins/htmlscrubber desc=htmlscrubber]]-Erweiterung aktiviert ist, weil auf diese Weise unsichere Inhalte eingefügt werden können.

source: Specifies a link to a file to be rendered as an "enclosure" in RSS/Atom feeds (and a plain old link in HTML). Useful for [[!iki podcast desc=podcasting]].
de: Gibt einen Link zu einer Datei an, der als "enclosure" in RSS-/Atom-Feeds verwendet werden soll (und als einfacher Link in HTML). Nützlich für [[!iki podcast desc=Podcasts]].

source: Causes the page to redirect to another page in the wiki.
de: Lässt die Seite auf eine andere Seite im Wiki weiterleiten.

source: \[[!meta redir=otherpage]]
de: \[[!meta redir=andereseite]]

source: The default is to redirect without delay. Optionally, a delay (in seconds) can be specified: "delay=10"
de: Voreingestellt ist die Weiterleitung ohne Verzögerung. Optional kann eine Verzögerung (in Sekunden) angegeben werden: "delay=10"

source: It can also be used to redirect to an external url. For example:
de: Es kann auch auf eine externe URL weitergeleitet werden. Zum Beispiel:

source: \[[!meta redir="http://example.com/"]]
de: \[[!meta redir="http://beispiel.de/"]]

source: For both cases, an anchor to jump to inside the destination page may also be specified using the common `#ANCHOR` syntax.
de: In beiden Fällen kann ein anzuspringender Anker auf der Zielseite angegeben werden, indem die übliche `#ANKER`-Syntax verwendet wird.

source: Causes the robots meta tag to be written:
de: Schreibt den robots-Meta-Tag:

source: Valid values for the attribute are: "index", "noindex", "follow", and "nofollow". Multiple comma-separated values are allowed, but obviously only some combinations make sense. If there is no robots meta tag, "index, follow" is used as the default.
de: Zulässige Werte sind `index`, `noindex`, `follow` und `nofollow`. Es können mehrere Werte durch Kommas getrennt angegeben werden, aber offensichtlich ergeben nur einige Kombinationen Sinn. Wenn der robots-Meta-Tag nicht explizit angegeben wird, wird als Voreinstellung "index,follow" angenommen.

source: The value is escaped, but its contents are not otherwise checked.
de: Der Wert wird nicht auf Zulässigkeit geprüft.

source: Specifies a globally unique ID for a page. This guid should be a URI, and it will be used to identify the page's entry in RSS and Atom feeds. If not given, the default is to use the page's URL as its guid.
de: Gibt eine global einmalige ID für die Seite an. Diese guid sollte eine URI sein und wird verwendet, um den Eintrag der Seite in RSS- und Atom-Feeds zu identifizieren. Wird keine guid angegeben, wird an dieser Stelle die URL der Seite verwendet.

source: This is mostly useful when a page has moved, to keep the guids for pages unchanged and avoid flooding aggregators (see [[!iki tips/howto_avoid_flooding_aggregators]]).
de: Diese Angabe ist in erster Linie dann nützlich, wenn eine Seite verschoben wurde: Indem die guids unverändert gelassen werden, kann das Fluten von Aggregatoren vermieden werden (siehe [[!iki tips/howto_avoid_flooding_aggregators]]).

source: Specifies a fake modification time for a page, to be output into RSS and Atom feeds. This is useful to avoid flooding aggregators that sort by modification time, like Planet: for instance, when editing an old blog post to add tags, you could set `updated` to be one second later than the original value. The date/time can be given in any format that [[!cpan TimeDate]] can understand, just like the `date` field and maps to the `<meta name="updated" content="...">` HTML header and internal `mtime` field.
de: Gibt eine gefälschte Änderungszeit für die Seite an, die dann von RSS- und Atom-Feeds ausgegeben wird. Dies ist nützlich, um Aggregatoren nicht zu fluten, die nach Änderungszeit sortieren, wie etwa Planet: Wenn man zum Beispiel einen alten Blog-Eintrag bearbeitet (etwa um Tags hinzuzufügen), kann man `updated` auf eine Sekunde später als den ursprünglichen Wert setzen. Das Datum mit Uhrzeit kann in jedem Format angegeben werden, das von [[!cpan TimeDate]] verstanden wird, genauso wie im Feld `date`. Außerdem wird das hier angegebene Datum als `<meta name=\"updated\" content=\"...\">` HTML-Header ausgegeben und als interner `mtime`-Wert verwendet.

source: Adds a Friend of a Friend ([FOAF](http://wiki.foaf-project.org/w/Autodiscovery)) reference to a page.
de: Fügt eine Freund-eines-Freundes-Referenz (Friend of a Friend, [FOAF](http://wiki.foaf-project.org/w/Autodiscovery)) zu einer Seite hinzu.

source: Adds a HTML `<meta>` header with this `name` attribute. Its other attributes are taken from the other parameters, so for example `\[[!meta name="foo" content="bar" x-non-standard-attribute="baz"]]` becomes `<meta name="foo" content="bar" x-non-standard-attribute="baz">`. This won't be allowed if the [[!iki plugins/htmlscrubber desc=htmlscrubber]] plugin is enabled, since it can be used to insert unsafe content.
de: Fügt einen HTML-`<meta>`-Header mit diesem `name`-Attribut hinzu. Weitere Attribute werden von den übrigen Parametern übernommen, so wird zum Beispiel `\[[!meta name="foo" content="bar" x-non-standard-attribute="baz"]]` zu `<meta name="foo" content="bar" x-non-standard-attribute="baz">`. Dies ist nicht erlaubt falls das [[!iki plugins/htmlscrubber desc=htmlscrubber]]-Plugin aktiviert ist, da sonst unsichere Inhalte eingefügt werden könnten.

source: Other fields
de: Weitere Felder

source: If the field is not one of the above predefined fields, the metadata will be written to the generated html page as a &lt;meta&gt; header. For example, `\[[!meta foo="bar"]]` becomes `<meta name="foo" content="bar">`. As with `name`, this won't be allowed if the [[!iki plugins/htmlscrubber desc=htmlscrubber]] plugin is enabled.
de: Wenn das Feld nicht eines der oben vordefinierten ist, werden die Metadaten als &lt;meta&gt;-Header in die generierte Seite geschrieben. Zum Beispiel wird `[[!meta foo="bar"]]` zu `<meta name="foo" content="bar">`. Wie bei `name` ist dies allerdings nicht erlaubt, wenn die [[!iki plugins/htmlscrubber desc=htmlscrubber]]-Erweiterung aktiv ist.

source: This syntax cannot be used for meta headers with unusual names, in particular names containing `:` such as `flattr:id` and `twitter:card`. Please use `\[[!meta name="..." content="..."]]` for those headers.
de: Diese Syntax kann nicht für meta-Header mit ungewöhnlichen Namen verwendet werden, insbesondere Namen die `:` enthalten wie etwa `flattr:id` und `twitter:card`. Für diese bitte `\[[!meta name="..." content="..."]]` verwenden.
