Repository: deepin-community/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/osm.*.po
Languages: de

source: The `osm` directive is supplied by the [[!iki plugins/osm desc=osm]] plugin.
de: Die `osm`-Anweisung wird durch das [[!iki plugins/osm desc=osm]]-Plugin bereitgestellt.

source: This directive inserts an OpenStreetMap map onto a page. It is typically combined with the [[waypoint]] directive to add points to the map.
de: Diese Anweisung fügt eine OpenStreetMap-Karte in eine Seite ein. Sie wird typischerweise mit der [[waypoint]]-Anweisung kombiniert, um Punkte zur Karte hinzuzufügen.

source: examples
de: Beispiele

source: \[[!osm]] \[[!waypoint lat="45°30N" lon="73°40W" name="My city" tag="city"]]
de: \[[!osm]] \[[!waypoint lat="45°30N" lon="73°40W" name="Meine Stadt" tag="Stadt"]]

source: The osm directive will display the actual map, while the waypoint directive adds waypoints to the map.
de: Die osm-Anweisung zeigt die Karte an, während die waypoint-Anweisungen Punkte zur Karte hinzufügen.

source: The above can also be shortened as:
de: Das obige Beispiel kann verkürzt werden:

source: \[[!waypoint lat="45°30N" lon="73°40W" name="My city" tag="city" embed]]
de: \[[!waypoint lat="45°30N" lon="73°40W" name="Meine Stadt" tag="Stadt" embed]]

source: The tag is also taken from the tags elsewhere in the page, so the above is equivalent to:
de: Der Tag wird auch von den übrigen Tags auf der Seite übernommen, sodass das folgende äquivalent ist:

source: \[[!waypoint lat="45°30N" lon="73°40W" name="My city" embed]] \[[!tag city]]
de: \[[!waypoint lat="45°30N" lon="73°40W" name="Meine Stadt" embed]] \[[!tag Stadt]]

source: The icon is also taken from the tag if attached to the tag page as icon.png (default, modifiable)..
de: Das Symbol wird auch vom Tag abgeleitet, falls es der Tag-Seite als icon.png angehängt ist (Voreinstellung, kann geändert werden).

source: map display
de: Karten-Anzeige

source: `map` - map to display, defaults to "map"
de: `map` - die anzuzeigende Karte, voreingestellt ist "map"

source: `zoom` - the level to zoom to on the OSM map
de: `zoom` - die anfängliche Zoom-Stufe der OSM-Karte

source: `loc` - lattitude and longitude of the map center
de: `loc` - Breiten- und Längengrad des Kartenmittelpunkts

source: `lat` - lattitude
de: `lat` - Breitengrad

source: `lon` - longitude
de: `lon` - Längengrad

source: `editable` - add edit controls in a separate layer
de: `editable` - Werkzeuge zum Bearbeiten in einer zusätzlichen Schicht anzeigen

source: `right` - float the map right
de: `right` - die Karte rechts neben dem Text schweben lassen

source: `left` - float the map left (default)
de: `left` - die Karte links neben dem Text schweben lassen (Voreinstellung)

source: `width` - width of the map
de: `width` - Breite der Karte

source: `height` - height of the map
de: `height` - Höhe der Karte

source: waypoints
de: Wegpunkte

source: Waypoints can be added to any page. By default the waypoint takes the name of the page, which allows you to easily tag pages and make them appear on the central map.
de: Wegpunkte können zu beliebigen Seiten hinzugefügt werden. In der Voreinstellung nimmt der Wegpunkt den Namen der Seite an, auf diese Weise können Seiten leicht mit Koordinaten versehen und auf einer zentralen Karte angezeigt werden.

source: Waypoints, by default, show up as a image (the `icon` parameter) link to the main map (or the `map` parameter provided). That markup can be hidden with the `hidden` parameter.
de: Wegpunkte erscheinen in der Voreinstellung als Bild (siehe Parameter `icon`), das auf die Hauptkarte verlinkt (oder auf die mit `map` angegebene Karte). Dies kann mit dem Parameter `hidden` unterbunden werden.

source: `name` - the name of this point, defaults to the page name (!) must be unique, otherwise later incantation will overwrite previous ones.
de: `name` - der Name dieses Punkts, voreingestellt ist der Seitenname. Er muss einmalig sein, sonst überschreiben spätere Wegpunkte die früheren.

source: `map` - the map to add the point to (defaults to "map")
de: `map` - die Karte, zu der der Wegpunkt hinzugefügt werden soll (voreingestellt ist "map")

source: `desc` - description to embed in the map
de: `desc` - Beschreibung, die in der Karte eingebettet werden soll

source: `loc` - lattitude and longitude
de: `loc` - Breiten- und Längengrad

source: `tag` - the type of points, maps to an icon in the osm_types array
de: `tag` - der Typ des Punkts, verweist auf ein Symbol im Array `osm_types`

source: `hidden` - do not display the link to the map (will not affect `embed`)
de: `hidden` - keinen Link zur Karte anzeigen (hat keinen Einfluss auf `embed`)

source: `icon` - URL to the icon to show in the link to the map and within the map
de: `icon` - URL zu einem Symbol, das im Link zur Karte und auf der Karte angezeigt werden soll

source: `embed` - embed the map display alongside the point, in which case the regular arguments to the map display can be used
de: `embed` - die Karte zusammen mit dem Punkt anzeigen; hierbei können alle Argumente zur Kartenanzeige verwendet werden

source: Links
de: Verknüpfungen

source: If two pages with waypoints have a link between them, that link will magically show up on the map. Now how awesome is that?
de: Wenn zwei Seiten mit Wegpunkten miteinander verknüpft sind, wird diese Verknüpfung auf magische Weise auf der Karte angezeigt. Wie großartig ist das?
