Repository: deepin-community/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/template.*.po
Languages: de

source: The `template` directive is supplied by the [[!iki plugins/template desc=template]] plugin.
de: Die `template`-Anweisung wird durch die [[!iki plugins/template desc=template]]-Erweiterung bereitgestellt.

source: The template directive allows wiki pages to be used as templates. These templates can be filled out and inserted into other pages in the wiki using the directive. The [[templates]] page lists templates that can be used with this directive.
de: Die `template`-Anweisung erlaubt es, Wiki-Seiten als Vorlagen zu verwenden. Diese Vorlagen können mit dieser Anweisung in anderen Seiten verwendet und ausgefüllt werden. Auf der [[Vorlagen|templates]]-Seite werden die Vorlagen aufgelistet, die mit dieser Anweisung verwendet werden können.

source: The directive has an `id` parameter that identifies the template to use. The remaining parameters are used to fill out the template.
de: Die Anweisung nutzt den Parameter `id`, um die zu verwendende Vorlage auszuwählen. Die übrigen Parameter werden verwendet, um die Vorlage auszufüllen.

source: Example
de: Beispiel

source: \[[!template id=note text="""Here is the text to insert into my note."""]]
de: \[[!template id=note text="""Hier ist der Text, der in meine Notiz eingefügt werden soll."""]]

source: This fills out the `note` template, filling in the `text` field with the specified value, and inserts the result into the page.
de: Dies füllt die Vorlage `note` aus, wobei das Feld `text` mit dem angegebenen Wert gefüllt wird, und fügt das Ergebnis in die Seite ein.

source: Using a template
de: Eine Vorlage verwenden

source: Generally, a value can include any markup that would be allowed in the wiki page outside the template. Triple-quoting the value even allows quotes to be included in it. Combined with multi-line quoted values, this allows for large chunks of marked up text to be embedded into a template:
de: Ein Wert kann im allgemeinen alle Hervorhebungen enthalten, die auf der Wiki-Seite außerhalb der Vorlage zulässig ist. Wenn der Wert in dreifache Anführungszeichen gesetzt wird, dürfen sogar Anführungszeichen verwendet werden. In Kombination mit mehrzeiligen Werten können so größere Textabschnitte mit Hervorhebungen in die Vorlage eingebettet werden:

source: \[[!template id=foo name="Sally" color="green" age=8 notes="""
de: \[[!template id=foo name="Sally" color="grün" age=8 notes="""

source: \[[Charley]]'s sister.
de: \[[Charley]]s Schwester.

source: "I want to be an astronaut when I grow up."
de: Wenn ich groß bin, möchte ich Astronaut werden.

source: Really 8 and a half.
de: Eigentlich 8 1/2.

source: Creating a template
de: Eine Vorlage anlegen

source: The template is in a regular wiki page, located in the `templates/` subdirectory inside the source directory of the wiki. The contents of the [[templatebody]] directive are used as the template. Anything outside that directive is not included in the template, and is usually used as documentation describing the template.
de: Die Vorlage ist eine normale Wiki-Seite, die um Unterverzeichnis `templates/` des Quellverzeichnisses des Wikis liegt. Der Inhalt der [[templatebody]]-Anweisung wird als Vorlage verwendet. Alles außerhalb dieser Anweisung ist nicht Teil der Vorlage und wird üblicherweise zu deren Dokumentation genutzt.

source: If the template does not contain a [[templatebody]] directive, the entire source of the page is used for the template. This is deprecated, because it leads to the template markup being interpreted as ordinary page source when the page is built, as well as being used as the template.
de: Wenn die Vorlagenseite keine [[templatebody]]-Anweisung enthält, wird die komplette Seite als Vorlage verwendet. Dies ist überholt, da es dazu führt, dass der Vorlagen-Inhalt zusätzlich als normale Seite interpretiert wird, während die Seite erzeugt wird.

source: Alternatively, templates can be stored in a directory outside the wiki, as files with the extension ".tmpl". By default, these are searched for in `/usr/share/ikiwiki/templates`, the `templatedir` setting can be used to make another directory be searched first. When referring to templates outside the wiki source directory, the "id" parameter is not interpreted as a pagespec, you must include the full filename of the template page including the ".tmpl" extension, and the templatebody directive is not used. E.g.:
de: Alternativ können Vorlagen außerhalb des Wikis gespeichert werden, als Dateien mit der der Erweiterung ".tmpl". Nach diesen wird standardmäßig unter `/usr/share/ikiwiki/templates` gesucht, wobei mit der Einstellung `templatedir` ein zuvor zu durchsuchendes Verzeichnis angegeben werden kann. Wenn eine Vorlage außerhalb des Wiki-Quellverzeichnisses angegeben wird, wird der Parameter `id` nicht als pagespec interpretiert, sodass der vollständige Dateiname der Vorlagenseite inklusive der Endung ".tmpl" angegeben werden muss. Außerdem wird in diesem Fall die templatebody-Anweisung nicht verwendet. Zum Beispiel:

source: The template uses the syntax used by the [[!cpan HTML::Template]] perl module, which allows for some fairly complex things to be done. Consult its documentation for the full syntax, but all you really need to know are a few things:
de: Die Vorlage nutzt die Syntax des Perl-Moduls [[!cpan HTML::Template]], mit der sich recht komplexe Dinge realisieren lassen. Die vollständige Syntax ist in der Dokumentation des Perl-Moduls zu finden, aber es genügt ein paar wenige Dinge zu wissen:

source: Each parameter you pass to the template directive will generate a template variable. There are also some pre-defined variables like PAGE and BASENAME.
de: Jeder Parameter, welcher der Vorlage übergeben wird, erzeugt eine Vorlagenvariable. Es gibt auch einige vordefinierte Variable wie `PAGE` und `BASENAME`.

source: To insert the value of a variable, use `<TMPL_VAR variable>`. Wiki markup in the value will first be converted to html.
de: Der Wert einer Variablen kann mit `<TMPL_VAR Variable>` eingefügt werden. Wiki-Hervorhebungen im Wert werden zuvor nach HTML umgewandelt.

source: To insert the raw value of a variable, with wiki markup not yet converted to html, use `<TMPL_VAR raw_variable>`.
de: Der wörtliche Wert einer Variable kann mit `<TMPL_VAR raw_Variable>` eingefügt werden; dabei werden Wiki-Hervorhebungen nicht nach HTML umgewandelt.

source: To make a block of text conditional on a variable being set use `<TMPL_IF variable>text</TMPL_IF>`.
de: Mit `<TMPL_IF Variable>Block</TMPL_IF>` wird ein Block nur dann eingefügt, wenn eine Variable gesetzt ist.

source: To use one block of text if a variable is set and a second if it's not, use `<TMPL_IF variable>text<TMPL_ELSE>other text</TMPL_IF>`
de: Mit `<TMPL_IF Variable>Block<TMPL_ELSE>anderer Block</TMPL_IF>` wird je nachdem ob eine Variable gesetzt ist ein Block oder ein anderer Block eingefügt.

source: Here's a sample template:
de: Hier ist eine Beispiel-Vorlage:

source: \[[!templatebody <<ENDBODY <span class="infobox"> Name: \[[<TMPL_VAR raw_name>]]<br /> Age: <TMPL_VAR age><br /> <TMPL_IF color> Favorite color: <TMPL_VAR color><br /> <TMPL_ELSE> No favorite color.<br /> </TMPL_IF> <TMPL_IF notes> <hr /> <TMPL_VAR notes> </TMPL_IF> </span> ENDBODY]]
de: \[[!templatebody <<ENDBODY <span class="infobox"> Name: \[[<TMPL_VAR raw_name>]]<br /> Alter: <TMPL_VAR alter><br /> <TMPL_IF color> Lieblingsfarbe: <TMPL_VAR farbe><br /> <TMPL_ELSE> Keine Lieblingsfarbr.<br /> </TMPL_IF> <TMPL_IF hinweise> <hr /> <TMPL_VAR hinweise> </TMPL_IF> </span> ENDBODY]]

source: This template describes a person. Parameters: name, age, color (favorite color, optional), notes (optional).
de: Diese Vorlage beschreibt eine Person. Parameter: name, alter, farbe (Lieblingsfarbe, optional), hinweise (optional).

source: The filled out template will be formatted the same as the rest of the page that contains it, so you can include WikiLinks and all other forms of wiki markup in the template. Note though that such WikiLinks will not show up as backlinks to the page that uses the template.
de: Die ausgefüllte Vorlage wird auf die gleiche Weise formatiert wie die Wiki-Seite, welche die Vorlage enthält. Es ist also möglich, in der Vorlage WikiLinks und sonstige Wiki-Anweisungen zu verwenden. Solche WikiLinks tauchen allerdings nicht als Backlinks der Seite auf, welche die Vorlage verwendet.

source: Note the use of "raw_name" inside the [[ikiwiki/WikiLink]] generator in the example above. This ensures that if the name contains something that might be mistaken for wiki markup, it's not converted to html before being processed as a [[ikiwiki/WikiLink]].
de: Zu beachten ist die Verwendung von "raw_Name" im [[ikiwiki/WikiLink]]-Generator im Beispiel oben. Falls der Name etwas enthält, das für eine Wiki-Hervorhebung gehalten werden könnte, wird das nicht nach HTML umgewandelt, bevor es als WikiLink verarbeitet wird.
